source/app/controllers/charges_controller.rb

  def index
    @charges = [
      {
        status: "Successful",
        data: Charge.successful.includes(:customer)
      },
      {
        status: "Failed",
        data: Charge.failed.includes(:customer)
      },
      {
        status: "Disputed",
        data: Charge.disputed.includes(:customer)
      }]
---
SELECT "charges".* FROM "charges" WHERE "charges"."status" = ?  [["status", 0]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" IN (?, ?, ?, ?)  [["id", 28], ["id", 29], ["id", 30], ["id", 31]]