source/app/controllers/charges_controller.rb

SELECT "charges".* FROM "charges"
SELECT `charges`.* FROM `charges` WHERE `charges`.`paid` = FALSE
SELECT `charges`.* FROM `charges` WHERE `charges`.`paid` = TRUE AND `charges`.`refunded` != TRUE
---
  def index
    @charges = Charge.all

    @failed_charges = Charge.where(paid: false)
    @disputed_charges = Charge.where(refunded: true)
    @successful_charges = Charge.where(paid: true, refunded: false)