Source/app/controllers/charges_controller.rb

  def index
    @successful = Charge.includes(:customer).successful
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" IN (3, 4)