source/app/controllers/customers_controller.rb

INSERT INTO "customers" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "starc"], ["last_name", "man"], ["created_at", "2021-05-28 19:50:38.564699"], ["updated_at", "2021-05-28 19:50:38.564699"]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save