source/app/views/charges/_charge.html.erb

<tr>
  <td><%= charge.customer.first_name %></td>
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = ? LIMIT 1  [["id", 3]]