source/app/views/charges/index.html.erb

SELECT "customers".* FROM "customers" WHERE "customers"."id" IN (?, ?, ?, ?)  [["id", 32], ["id", 33], ["id", 34], ["id", 35]]
---
      <tr>
        <td><%= charge.customer.first_name %></td>